app/Controllers/Equipment.php

SELECT *
FROM `equipment`
---
    public function index()
    {

        // $getData = $this->modelUnit->getData();
        // $data= array(
        //     'title' => 'All Data Equipment',
        //     'dataUnit' => $getData,
        // );
        $equipmodel = new EquipmentModel();
        $getAlldata = $equipmodel->findAll();

INSERT INTO `equipment` (`nolambung`, `waktu`, `status`, `id_project`) VALUES ('DT-35555', '17.40', 'NonOperat', '3')
---
    public function storing()
    {
        $equipmodel = new EquipmentModel();
        $equipmodel->insert($this->request->getPost());

SELECT *
FROM `equipment`
WHERE `equipment`.`id` = '18'
---
    public function formEditchart($id)
    {
        $equipmodel = new EquipmentModel();
        $data_id = $equipmodel->find($id);

DELETE FROM `equipment`
WHERE `id` IN ('15')
---
    public function hapusdatachart($id=false)
    {
        $equipmodel = new EquipmentModel();
        $equipmodel->delete($id);